dogma2u/A-discord-bot-on-ESP32/MiniMe_Discord_Bot/MiniMe_Discord_Bot.ino
// ====== FORWARD DECLARATIONS ======
bool readTemperature(float &tempC, float &tempF);
bool readHttpBodyAfterHeaders(Client& client, bool chunked, int contentLength,
                              String& outBody, unsigned long deadlineMs);
bool discordIdLooksValid(const String& id);

// ====== DISPLAY UTILS ======
// Wake/sleep, overlays, dashboard paint. U8g2 y is baseline (not Adafruit setCursor).

// Wake the panel if it was in power-save, and restart the 1-minute idle timer.
void noteDisplayActivity() {
  lastDisplayActivityMillis = millis();
  if (displayAsleep) {
    displayAsleep = false;
    u8g2.setPowerSave(0);
    lastDashMillis = 0;
  }
  u8g2.setContrast(DISPLAY_CONTRAST_FULL);
}

// ISR: touchAttachInterrupt sets flag; pollTouchWake() debounces and calls noteDisplayActivity().
void IRAM_ATTR onTouchWake() {
  touchWakePending = true;
}

uint32_t readTouchRaw(uint8_t pin) {
  return (uint32_t)touchRead(pin);
}

bool touchSampleValid(uint32_t raw) {
  return raw > 0 && raw < 150000;
}

// Boot: median of 20 idle samples → touchIdleMin (trip = idleMin + TOUCH_THRESHOLD).
void calibrateTouchIdleMin() {
  uint32_t samples[20];
  uint8_t count = 0;
  for (int i = 0; i < 20; i++) {
    uint32_t raw = readTouchRaw(PIN_TOUCH);
    if (touchSampleValid(raw)) samples[count++] = raw;
    delay(25);
  }
  if (count == 0) {
    touchIdleMin = readTouchRaw(PIN_TOUCH);
    return;
  }
  for (uint8_t i = 0; i + 1 < count; i++) {
    for (uint8_t j = i + 1; j < count; j++) {
      if (samples[j] < samples[i]) {
        uint32_t t = samples[i];
        samples[i] = samples[j];
        samples[j] = t;
      }
    }
  }
  touchIdleMin = samples[count / 2];
  touchRawMax = touchIdleMin;
}

// Slow drift tracking while not touched (keeps trip point stable over temperature/humidity).
void updateTouchIdleMin(uint32_t raw) {
  if (!touchSampleValid(raw)) return;
  if (raw < touchIdleMin) {
    touchIdleMin = raw;
    return;
  }
  if (raw <= touchIdleMin + (TOUCH_THRESHOLD / 4)) {
    touchIdleMin = (touchIdleMin * 31 + raw) / 32;
  }
}

void configureTouchHardware() {
#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 5, 0)
  touchSetTiming(0.5f, 100); // Arduino ESP32 3.x / IDF 5.5+
#else
  touchSetCycles(1, 100);
#endif
}

// Call once in setup() after WiFi/I2C — do not recalibrate earlier.
void setupTouch() {
  // Serial.println("--- touch init ---");
  configureTouchHardware();
  calibrateTouchIdleMin();
  touchDetachInterrupt(PIN_TOUCH);
  touchAttachInterrupt(PIN_TOUCH, onTouchWake, 0);
  // Serial.print("touch GPIO");
  // Serial.print(PIN_TOUCH);
  // Serial.print(" idleMin=");
  // Serial.print(touchIdleMin);
  // Serial.print(" trip=");
  // Serial.println(touchIdleMin + TOUCH_THRESHOLD);
}

void debugTouchSerial() {
  unsigned long now = millis();
  if (now - lastTouchDebugMillis < TOUCH_DEBUG_MS) return;
  lastTouchDebugMillis = now;

  uint32_t raw = readTouchRaw(PIN_TOUCH);
  uint32_t trip = touchIdleMin + TOUCH_THRESHOLD;
  bool touched = raw >= trip;

  if (!touched) updateTouchIdleMin(raw);
  if (raw > touchRawMax) touchRawMax = raw;

  // Serial.print("touch GPIO");
  // Serial.print(PIN_TOUCH);
  // Serial.print(": raw=");
  // Serial.print(raw);
  // Serial.print(" idleMin=");
  // Serial.print(touchIdleMin);
  // Serial.print(" trip=");
  // Serial.print(trip);
  // Serial.print(" touched=");
  // Serial.println(touched ? "YES" : "no");
}

bool touchIsActive() {
  uint32_t raw = readTouchRaw(PIN_TOUCH);
  if (raw >= touchIdleMin + TOUCH_THRESHOLD) return true;
#if SOC_TOUCH_SENSOR_VERSION == 2
  if (touchInterruptGetLastStatus(PIN_TOUCH)) return true;
#endif
  updateTouchIdleMin(raw);
  return false;
}

// Polling fallback + interrupt flag; debounced wake into noteDisplayActivity().
void pollTouchWake() {
  unsigned long now = millis();
  if (now - lastTouchWakeMillis < TOUCH_DEBOUNCE_MS) return;
  if (!touchWakePending && !touchIsActive()) return;
  touchWakePending = false;
  lastTouchWakeMillis = now;
  noteDisplayActivity();
  noteBotActivity(); // touch also sets Discord Online
}

// After 1 minute idle, dim over 15 s, then blank the OLED. Clock/RSSI/heap ticks do not count.
void updateDisplaySleep() {
  if (displayAsleep) return;
  unsigned long now = millis();
  if (lastDisplayActivityMillis == 0) {
    lastDisplayActivityMillis = now;
    return;
  }

  unsigned long idle = now - lastDisplayActivityMillis;
  if (idle < DISPLAY_IDLE_MS) return;

  if (idle < DISPLAY_IDLE_MS + DISPLAY_DIM_MS) {
    unsigned long dimElapsed = idle - DISPLAY_IDLE_MS;
    uint8_t contrast = (uint8_t)(DISPLAY_CONTRAST_FULL -
      (dimElapsed * (unsigned long)DISPLAY_CONTRAST_FULL) / DISPLAY_DIM_MS);
    u8g2.setContrast(contrast);
    return;
  }

  displayAsleep = true;
  u8g2.setPowerSave(1); // panel off until touch or a real event
}

// Queue a 2-line status (OLED rows 15-16). Dashboard is not replaced.
void showTransient(const String& line1, const String& line2 = "", const String& line3 = "", unsigned long durationMs = 3000) {
  noteDisplayActivity();
  transientLine1 = line1;
  transientLine2 = line2;
  transientLine3 = line3;
  transientUntilMs = millis() + durationMs;
  lastDashMillis = 0; // loop/updateDisplay paints; do not draw here (stack + NTP inside Gateway)
}

// Draw the persistent dashboard (128x128 SSD1327)
// U8g2 drawStr(x, y): y is the FONT BASELINE, not the top of the glyph and not setCursor.
// 5x7 font is 7px tall, so header at y=7 sits on the top of the panel (pixels ~0-6).
// Font: u8g2_font_5x7_tf = 5px wide + 1px gap = 6px/char, 7px tall + 1px gap = 8px/row
// Grid: 16 rows x 18 chars on 128x128
// Row baselines (y = row*8, glyph baseline at y+7):
//   Row 0  y=7   Header: MiniMe + GW:good/bad + right-justified time
//   Row 2  y=15  Sig bar
//   Row 3  y=23  Heap bar
//   Row 4  y=31  Srv bar (0-90 deg)
//   Row 5  y=39  Up:xxxxdxxhxxm T:xxxF/xxxC  (or T:--Error--; space-padded)
//   Row 6  y=47  User1
//   Row 7  y=55  User2
//   Row 8  y=63  User3
//   Row 9  y=71  User4
//   Row 10 y=79  User5
//   Row 11 y=87  User6
//   Row 12 y=95  User7
//   Row 13 y=103 User8
//   Row 14 y=111 Bot:Online/Idle (left, 10) + Www Mmm dd YYYY (right, 15; fixed slot)
//   Row 15 y=119 command / !display text (blank when idle)
//   Row 16 y=127 command / !display text (blank when idle)
void drawDashboard() {
  u8g2.clearBuffer();
  u8g2.setFont(u8g2_font_5x7_tf);

  // ---- Row 0: Header (MiniMe + GW + right-justified time) ----
  updateLocalTime();
  String t = timeClient.getFormattedTime(); // HH:MM:SS
  String gwHeader = gatewayConnected ? "GW:Good" : "GW:Bad";
  u8g2.drawStr(0, 7, "MiniMe");
  u8g2.drawStr(42, 7, gwHeader.c_str());
  // True right-justify using actual rendered width.
  int timeX = 128 - u8g2.getStrWidth(t.c_str());
  if (timeX < 0) timeX = 0;
  u8g2.drawStr(timeX, 7, t.c_str());

  // ---- Rows 2-3: Signal + Heap bars ----
  long rssi = WiFi.RSSI();
  uint32_t freeHeap = ESP.getFreeHeap();
  uint32_t totalHeap = ESP.getHeapSize();

  // Signal bar (row 2)
  int sigBarW = 0;
  if (rssi >= -40) sigBarW = 79;
  else if (rssi <= -100) sigBarW = 0;
  else sigBarW = (int)((rssi + 100) * 79 / 60);
  u8g2.drawStr(0, 15, "Sig:");
  u8g2.drawFrame(25, 8, 103, 8);
  if (sigBarW > 0) u8g2.drawBox(26, 9, sigBarW, 6);

  // Heap bar (row 3) — internal SRAM + this board's 8MB PSRAM, original 8px height
  uint32_t psramSize = ESP.getPsramSize();
  uint32_t psramFree = ESP.getFreePsram();
  if (psramSize < BOARD_PSRAM_BYTES) psramSize = BOARD_PSRAM_BYTES;
  if (psramFree < 1) psramFree = BOARD_PSRAM_BYTES;
  uint32_t memTotal = totalHeap + psramSize;
  uint32_t memFree  = freeHeap + psramFree;
  int heapBarW = 0;
  if (memTotal > 0) {
    heapBarW = (int)((memFree * 79UL) / memTotal);
    if (heapBarW < 0) heapBarW = 0;
    if (heapBarW > 79) heapBarW = 79;
  }
  u8g2.drawStr(0, 23, "Heap:");
  u8g2.drawFrame(25, 16, 103, 8);
  if (heapBarW > 0) u8g2.drawBox(26, 17, heapBarW, 6);

  // Servo bar (row 4) — last !servo angle 0-90, fill matches inner frame (101px)
  const int srvInnerW = 101;
  int srvBarW = (lastServoDeg * srvInnerW) / 90;
  if (srvBarW < 0) srvBarW = 0;
  if (srvBarW > srvInnerW) srvBarW = srvInnerW;
  u8g2.drawStr(0, 31, "Srv:");
  u8g2.drawFrame(25, 24, 103, 8);
  if (srvBarW > 0) u8g2.drawBox(26, 25, srvBarW, 6);

  // ---- Row 5: Up + Temp — Up:xxxxdxxhxxm T:xxxF/xxxC (space-pad, no leading zeros) ----
  unsigned long uptimeSec = millis() / 1000;
  unsigned long d = uptimeSec / 86400;
  unsigned long h = (uptimeSec % 86400) / 3600;
  unsigned long m = (uptimeSec % 3600) / 60;
  if (d > 9999) d = 9999;
  char upTempBuf[32];
  if (dashTempC > -998.0f) {
    snprintf(upTempBuf, sizeof(upTempBuf), "Up:%4lud%2luh%2lum T:%3.0fF/%3.0fC",
             d, h, m, dashTempF, dashTempC);
  } else {
    snprintf(upTempBuf, sizeof(upTempBuf), "Up:%4lud%2luh%2lum T:--Error--", d, h, m);
  }
  u8g2.drawStr(0, 39, upTempBuf);

  // ---- Rows 6-13: eight user stats (5x7 + 1px pad = 8px rows) ----
  // Name left, status after the longest name, Bot:N right-justified. Empty slots show ---.
  u8g2.setFont(u8g2_font_5x7_tf);
  const int gapPx = 4;
  const int statusW = u8g2.getStrWidth("Idle");
  const int botReserveW = u8g2.getStrWidth("Bot:999");
  int nameMaxPx = 128 - gapPx - statusW - gapPx - botReserveW;
  if (nameMaxPx < 16) nameMaxPx = 16;

